package sec01.exam01;

// 입출력 스트림이란?
// Stream(스트림): 개울(시내), 흐르다 = 마치 물과 같이 데이터가 흘러서 지나감
// 데이터를 연속된 흐름으로 읽고/쓰는 것으로 입출력 할 수 있게 도와주는 클래스
// Java에서는 스트림을 통해 파일, 네트워크, 키보드, 메모리 등에서 데이터를 주고받을 수 있음
// 입력 스트림: 외부 -> 프로그램으로 데이터 읽기
// 출력 스트림: 프로그램 -> 외부로 데이터 쓰기

// 스트림의 종류
// 구분  바이트 기반(1byte)    문자 기반(2byte = char) => 내부적으로 인코딩/디코딩 처리
// 입력  InputStream         Reader
// 출력  OutputStream        Writer

// 바이너리 파일, 바이너리 데이터란?
// 말 그대로 0과 1로 이루어진 이진 데이터
// 우리가 다루는 데이터는 크게 두 종류로 나눌 수 있음
// 1. 텍스트 데이터: 사람이 읽을 수 있는 문자 중심의 데이터(예: "hello", "123", "이것은 텍스트")
// 2. 바이너리 데이터: 사람이 읽을 수 없는 0과 1의 이진 형식으로 저장된 데이터
// (예: 이미지, 동영상, 음악, pdf, 실행파일 등 텍스트가 아닌 모든 데이터)

public class WriteExample {

	public static void main(String[] args) {
		
	}

}
